/*
==================================
Born2DEV : C-programming zero2one
[Section 2] Assignment 7 : โปรแกรมช่วยคิดเงินร้านลุงสมหมาย
==================================
>Problem: ตัวเลขตัวแรกจะเป็นราคาของสินค้าที่ขาย กับตัวเลขตัวที่สองซึ่งเป็นจำนวนของสินค้าที่ลูกค้าซื้อ
         ให้เรานำมาคำนวณในการรวมราคา

inp: 500
     3
out: 1500
-----------------------------------
inp: 120
     10
out: 1200
*/
#include <stdio.h>
int main(){
    int cost, amount;
    scanf("%d",&cost);
    scanf("%d",&amount);
    printf("%d",cost*amount);
}